apps/backend/tests/load/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    # Warm up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Ramp up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up"
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Spike test phase
    - duration: 60
      arrivalRate: 100
      name: "Spike test"
    # Recovery phase
    - duration: 120
      arrivalRate: 10
      name: "Recovery"
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./load-test-helpers.js"

scenarios:
  # Health check flow
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  # Registration flow
  - name: "User Registration"
    weight: 20
    flow:
      - function: "generateRandomUser"
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "{{ email }}"
            fullName: "{{ fullName }}"
            password: "{{ password }}"
          expect:
            - statusCode: 201
            - statusCode: 400  # Email might already exist

  # Login flow
  - name: "User Login"
    weight: 30
    flow:
      - function: "getTestCredentials"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          expect:
            - statusCode: 200
            - statusCode: 401
            - statusCode: 429
          capture:
            - json: "$.data.accessToken"
              as: "accessToken"
            - json: "$.data.refreshToken"
              as: "refreshToken"
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200
            - statusCode: 401

  # Token refresh flow
  - name: "Token Refresh"
    weight: 15
    flow:
      - function: "getTestCredentials"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.refreshToken"
              as: "refreshToken"
      - post:
          url: "/api/v1/auth/refresh"
          json:
            refreshToken: "{{ refreshToken }}"
          expect:
            - statusCode: 200
            - statusCode: 401

  # Password reset request flow
  - name: "Password Reset Request"
    weight: 10
    flow:
      - post:
          url: "/api/v1/auth/forgot-password"
          json:
            email: "test@example.com"
          expect:
            - statusCode: 200
            - statusCode: 429

  # Mixed auth operations
  - name: "Mixed Operations"
    weight: 15
    flow:
      - function: "getTestCredentials"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "accessToken"
            - json: "$.data.refreshToken"
              as: "refreshToken"
      - get:
          url: "/api/v1/auth/sessions"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200
      - post:
          url: "/api/v1/auth/logout"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200